perf/1cpu.gif.v3.log
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        AKENOQ
Server Hostname:        127.0.0.1
Server Port:            5933

Document Path:          /httptest/pic_ask.gif
Document Length:        1747 bytes

Concurrency Level:      100
Time taken for tests:   12.666 seconds
Complete requests:      100000
Failed requests:        0
Total transferred:      188500000 bytes
HTML transferred:       174700000 bytes
Requests per second:    7895.30 [#/sec] (mean)
Time per request:       12.666 [ms] (mean)
Time per request:       0.127 [ms] (mean, across all concurrent requests)
Transfer rate:          14533.83 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       3
Processing:     1   13   2.4     11      37
Waiting:        1   13   2.3     11      37
Total:          4   13   2.4     11      37

Percentage of the requests served within a certain time (ms)
  50%     11
  66%     14
  75%     15
  80%     15
  90%     15
  95%     16
  98%     19
  99%     21
 100%     37 (longest request)