perf/4cpu.gif.v3.log
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        AKENOQ
Server Hostname:        127.0.0.1
Server Port:            5933

Document Path:          /httptest/pic_ask.gif
Document Length:        1747 bytes

Concurrency Level:      100
Time taken for tests:   8.661 seconds
Complete requests:      100000
Failed requests:        0
Total transferred:      188500000 bytes
HTML transferred:       174700000 bytes
Requests per second:    11545.51 [#/sec] (mean)
Time per request:       8.661 [ms] (mean)
Time per request:       0.087 [ms] (mean, across all concurrent requests)
Transfer rate:          21253.21 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    3   1.5      3      24
Processing:     2    6   3.3      5      51
Waiting:        0    5   3.2      4      51
Total:          5    9   3.4      7      55

Percentage of the requests served within a certain time (ms)
  50%      7
  66%      8
  75%      8
  80%      9
  90%     12
  95%     16
  98%     19
  99%     23
 100%     55 (longest request)