perf/4cpu.wiki.v3.log
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        AKENOQ
Server Hostname:        127.0.0.1
Server Port:            5933

Document Path:          /httptest/wikipedia_russia.html
Document Length:        954824 bytes

Concurrency Level:      100
Time taken for tests:   130.176 seconds
Complete requests:      100000
Failed requests:        0
Total transferred:      95496400000 bytes
HTML transferred:       95482400000 bytes
Requests per second:    768.19 [#/sec] (mean)
Time per request:       130.176 [ms] (mean)
Time per request:       1.302 [ms] (mean, across all concurrent requests)
Transfer rate:          716399.28 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    2   1.7      2      51
Processing:     3  128  33.0    124     426
Waiting:        0   19  30.4      7     245
Total:          6  130  33.0    126     427

Percentage of the requests served within a certain time (ms)
  50%    126
  66%    130
  75%    134
  80%    137
  90%    158
  95%    192
  98%    237
  99%    269
 100%    427 (longest request)