perf/nginx.w.log
akenoq@AkenoqPC:~/PYTHON_3/HTTPserver_test$ sudo service nginx start
akenoq@AkenoqPC:~/PYTHON_3/HTTPserver_test$ ab -n 100000 -c 100 127.0.0.1:80/httptest/wikipedia_russia.html
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 10000 requests
Completed 20000 requests
Completed 30000 requests
Completed 40000 requests
Completed 50000 requests
Completed 60000 requests
Completed 70000 requests
Completed 80000 requests
Completed 90000 requests
Completed 100000 requests
Finished 100000 requests


Server Software:        nginx/1.10.3
Server Hostname:        127.0.0.1
Server Port:            80

Document Path:          /httptest/wikipedia_russia.html
Document Length:        954824 bytes

Concurrency Level:      100
Time taken for tests:   27.766 seconds
Complete requests:      100000
Failed requests:        0
Total transferred:      95507100000 bytes
HTML transferred:       95482400000 bytes
Requests per second:    3601.56 [#/sec] (mean)
Time per request:       27.766 [ms] (mean)
Time per request:       0.278 [ms] (mean, across all concurrent requests)
Transfer rate:          3359123.93 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       3
Processing:     8   27   3.8     27     126
Waiting:        0    1   3.3      0     124
Total:          9   28   3.8     27     128

Percentage of the requests served within a certain time (ms)
  50%     27
  66%     29
  75%     30
  80%     30
  90%     31
  95%     33
  98%     34
  99%     35
 100%    128 (longest request)